app/models/form/fixedcost_form.rb

SELECT `fixedcosts`.* FROM `fixedcosts` ORDER BY `fixedcosts`.`created_at` ASC
---
    def initialize(attributes = {})
        super attributes

        fixedcosts = Fixedcost.order(created_at: :asc)
        self.fixedcost_values = fixedcosts.map { |fixedcost| FixedcostValue.new(fixedcost_id: fixedcost.id) } unless fixedcost_values.present?

INSERT INTO `fixedcost_values` (`fixedcost_id`, `yearmonth`, `value`, `description`, `created_at`, `updated_at`) VALUES (1, '2019-12-01', 2000, '電気12月', '2019-12-31 08:07:09.503999', '2019-12-31 08:07:09.503999')
---
        def save
            return false unless valid?
            FixedcostValue.transaction {
                self.fixedcost_values.select.each { |fixedcost_value|
                a1 = FixedcostValue.new(:fixedcost_id => fixedcost_value.fixedcost_id,
                    :yearmonth => fixedcost_value.yearmonth,
                    :value => fixedcost_value.value,
                    :description => fixedcost_value.description)
                a1.save!