app/models/form/income_form.rb

	def initialize(attributes = {})
    super attributes
		incomes = Income.order(created_at: :asc)
		self.income_values = incomes.map { |income| IncomeValue.new(income_id: income.id) } unless income_values.present?
---
SELECT `incomes`.* FROM `incomes` ORDER BY `incomes`.`created_at` ASC

	def save
		return false unless valid?
		IncomeValue.transaction {
			self.income_values.select.each { |income_value|
				a1 = IncomeValue.new(:income_id => income_value.income_id,
					:yearmonth => income_value.yearmonth,
					:value => income_value.value,
					:description => income_value.description)
				a1.save!
---
INSERT INTO `income_values` (`income_id`, `yearmonth`, `value`, `description`, `created_at`, `updated_at`) VALUES (1, '2019-11-01', 2000, '11月', '2019-12-31 07:08:02.995904', '2019-12-31 07:08:02.995904')