app/models/form/variablecost_form.rb

SELECT `variablecosts`.* FROM `variablecosts` ORDER BY `variablecosts`.`created_at` ASC
---
	def initialize(attributes = {})
    super attributes

		variablecosts = Variablecost.order(created_at: :asc)
		self.variablecost_values = variablecosts.map { |variablecost| VariablecostValue.new(variablecost_id: variablecost.id) } unless variablecost_values.present?

INSERT INTO `variablecost_values` (`variablecost_id`, `yearmonth`, `value`, `description`, `created_at`, `updated_at`) VALUES (1, '2019-12-31', 500, '材料12月', '2019-12-31 09:02:57.877766', '2019-12-31 09:02:57.877766')
---
	def save
		return false unless valid?
		VariablecostValue.transaction {
			self.variablecost_values.select.each { |variablecost_value|
				a1 = VariablecostValue.new(:variablecost_id => variablecost_value.variablecost_id,
					:yearmonth => variablecost_value.yearmonth,
					:value => variablecost_value.value,
					:description => variablecost_value.description)
				a1.save!