app/views/fixedcost_values/index.html.erb

        <td><%= fixedcost_value.yearmonth.strftime('%Y年%m月') %></td>
        <td><%= @fixedcosts.find(fixedcost_value.fixedcost_id).name %></td>
---
SELECT `fixedcosts`.* FROM `fixedcosts` WHERE `fixedcosts`.`id` = 1 ORDER BY `fixedcosts`.`created_at` ASC LIMIT 1