app/views/fixedcost_values/new.html.erb

        <th>
            <%= @fixedcosts.find(@form.fixedcost_values[cnt].fixedcost_id).name %>
---
SELECT `fixedcosts`.* FROM `fixedcosts` WHERE `fixedcosts`.`id` = 1 ORDER BY `fixedcosts`.`created_at` ASC LIMIT 1