app/views/variablecost_values/index.html.erb

SELECT `variablecosts`.* FROM `variablecosts` WHERE `variablecosts`.`id` = 1 ORDER BY `variablecosts`.`created_at` ASC LIMIT 1
---
        <td><%= variablecost_value.yearmonth.strftime('%Y年%m月') %></td>
        <td><%= @variablecosts.find(variablecost_value.variablecost_id).name %></td>