app/views/variablecost_values/new.html.erb

    <th>
    <%= @variablecosts.find(@form.variablecost_values[cnt].variablecost_id).name %>
---
SELECT `variablecosts`.* FROM `variablecosts` WHERE `variablecosts`.`id` = 1 ORDER BY `variablecosts`.`created_at` ASC LIMIT 1