app/controllers/balance_confirm_controller.rb

  def show
    @yearmonth = params[:yearmonth] + "-01"
		@incomes = Income.order(created_at: :asc)
		@fixedcosts = Fixedcost.order(created_at: :asc)
		@variablecosts = Variablecost.order(created_at: :asc)

    #収入計算
		@income_values =IncomeValue.where(yearmonth: @yearmonth)
		@income_value_total = cal_income_total(@income_values)

		#固定費計算
		@fixedcost_values = FixedcostValue.where(yearmonth: @yearmonth)
		@fixedcost_value_total = cal_fixedcost_total(@fixedcost_values)

		#変動費計算
		@variablecost_values = VariablecostValue.where(yearmonth: @yearmonth)
---
SELECT `income_values`.* FROM `income_values` WHERE `income_values`.`yearmonth` = '2019-12-01'
SELECT `fixedcost_values`.* FROM `fixedcost_values` WHERE `fixedcost_values`.`yearmonth` = '2019-12-01'
SELECT `variablecost_values`.* FROM `variablecost_values` WHERE `variablecost_values`.`yearmonth` = '2019-12-01'

	def show_year
		year = params[:year]
		@year = year
		months = ["01", "02", "03", "04", "05", "06", "07", "08", "09", "10", "11", "12" ]
		yearmonths = months.map do |month|
			year+"-"+month+"-01"
		end

		puts yearmonths

		#年度の収入配列を作成
		i=0
		total = [nil,nil,nil,nil,nil,nil,nil,nil,nil,nil,nil,nil]
		yearmonths.each do |yearmonth|
			income_values = IncomeValue.where(yearmonth: yearmonth)
			if income_values.present?
				total[i] = cal_income_total(income_values)
			end
			i += 1
		end
		@income_value_totals = total

		#年度の固定費配列を作成
		i=0
		total = [nil,nil,nil,nil,nil,nil,nil,nil,nil,nil,nil,nil]
		yearmonths.each do |yearmonth|
			fixedcost_values = FixedcostValue.where(yearmonth: yearmonth)
			if fixedcost_values.present?
---
SELECT `income_values`.* FROM `income_values` WHERE `income_values`.`year_month` = '2019-01-01'
SELECT `fixedcost_values`.* FROM `fixedcost_values` WHERE `fixedcost_values`.`yearmonth` = '2019-01-01'

		i=0
		total = [nil,nil,nil,nil,nil,nil,nil,nil,nil,nil,nil,nil]
		yearmonths.each do |yearmonth|
			variablecost_values = VariablecostValue.where(yearmonth: yearmonth)
			if variablecost_values.present?
---
SELECT `variablecost_values`.* FROM `variablecost_values` WHERE `variablecost_values`.`yearmonth` = '2019-01-01'