app/controllers/fixedcost_values_controller.rb

SELECT `fixedcost_values`.* FROM `fixedcost_values` ORDER BY year_month asc
---
    def index
        @fixedcosts = Fixedcost.order(created_at: :asc)
        @fixedcost_values = FixedcostValue.order("yearmonth asc")

SELECT `fixedcosts`.* FROM `fixedcosts` ORDER BY `fixedcosts`.`created_at` ASC
---
    def new
        year_month_day = params[:yearmonth] + "-01"
        @yearmonth = year_month_day.to_date

        @fixedcosts = Fixedcost.order(created_at: :asc)

SELECT `fixedcost_values`.* FROM `fixedcost_values` WHERE `fixedcost_values`.`id` = 1 LIMIT 1
SELECT `fixedcosts`.* FROM `fixedcosts` WHERE `fixedcosts`.`id` = 1 LIMIT 1
---
    def edit
        @fixedcost_value = FixedcostValue.find(params[:id])
        @fixedcost = Fixedcost.find(@fixedcost_value.fixedcost_id)

SELECT `fixedcost_values`.* FROM `fixedcost_values` WHERE `fixedcost_values`.`id` = 1 LIMIT 1
UPDATE `fixedcost_values` SET `fixedcost_values`.`value` = 2500, `fixedcost_values`.`updated_at` = '2019-12-31 08:20:31.968175' WHERE `fixedcost_values`.`id` = 1
---
    def update
        @fixedcost_value = FixedcostValue.find(params[:id])
        @fixedcost_value.assign_attributes(params[:fixedcost_value])
        if @fixedcost_value.save