app/controllers/fixedcosts_controller.rb

	def index
		@fixedcosts = Fixedcost.order(created_at: :asc)
---
SELECT `fixedcosts`.* FROM `fixedcosts` ORDER BY `fixedcosts`.`created_at` ASC

	def show
		@fixedcost = Fixedcost.find(params[:id])
---
SELECT `fixedcosts`.* FROM `fixedcosts` WHERE `fixedcosts`.`id` = 1 LIMIT 1

	def edit
		@fixedcost = Fixedcost.find(params[:id])
---
SELECT `fixedcosts`.* FROM `fixedcosts` WHERE `fixedcosts`.`id` = 2 LIMIT 1

	def create
		@fixedcost = Fixedcost.new(params[:fixedcost])
		if @fixedcost.save
---
INSERT INTO `fixedcosts` (`name`, `description`, `created_at`, `updated_at`) VALUES ('電気代', '九州電力', '2019-12-21 02:08:39.891777', '2019-12-21 02:08:39.891777')

	def update
		@fixedcost = Fixedcost.find(params[:id])
		@fixedcost.assign_attributes(params[:fixedcost])
		if @fixedcost.save
---
SELECT `fixedcosts`.* FROM `fixedcosts` WHERE `fixedcosts`.`id` = 2 LIMIT 1
UPDATE `fixedcosts` SET `fixedcosts`.`description` = '熊本市', `fixedcosts`.`updated_at` = '2019-12-21 02:09:03.123305' WHERE `fixedcosts`.`id` = 2