app/controllers/incomes_controller.rb

SELECT `incomes`.* FROM `incomes` ORDER BY `incomes`.`created_at` ASC
---
    def index
        @incomes = Income.order(created_at: :asc)

SELECT `incomes`.* FROM `incomes` WHERE `incomes`.`id` = 1 LIMIT 1
---
    def show
        @income = Income.find(params[:id])

SELECT `incomes`.* FROM `incomes` WHERE `incomes`.`id` = 1 LIMIT 1
---
    def edit
        @income = Income.find(params[:id])

INSERT INTO `incomes` (`name`, `description`, `created_at`, `updated_at`) VALUES ('売上', '1か月の売上', '2019-12-21 02:07:49.066236', '2019-12-21 02:07:49.066236')
---
    def create
        @income = Income.new(params[:income])
		if @income.save