app/controllers/income_values_controller.rb

	def index
		@incomes = Income.order(created_at: :asc)
		@income_values = IncomeValue.order("yearmonth asc")
---
SELECT `income_values`.* FROM `income_values` ORDER BY year_month asc

	def new
		year_month_day = params[:yearmonth] + "-01"
		@yearmonth = year_month_day.to_date

		@incomes = Income.order(created_at: :asc)
---
SELECT `incomes`.* FROM `incomes` ORDER BY `incomes`.`created_at` ASC

	def edit
		@income_value = IncomeValue.find(params[:id])
		@income = Income.find(@income_value.income_id)
---
SELECT `income_values`.* FROM `income_values` WHERE `income_values`.`id` = 1 LIMIT 1
SELECT `incomes`.* FROM `incomes` WHERE `incomes`.`id` = 1 LIMIT 1

	def update
		@income_value = IncomeValue.find(params[:id])
		@income_value.assign_attributes(params[:income_value])
		if @income_value.save
---
SELECT `income_values`.* FROM `income_values` WHERE `income_values`.`id` = 1 LIMIT 1
UPDATE `income_values` SET `income_values`.`value` = 5000, `income_values`.`description` = '雑12月', `income_values`.`updated_at` = '2019-12-31 07:06:39.122824' WHERE `income_values`.`id` = 2