app/controllers/variablecosts_controller.rb

SELECT `variablecosts`.* FROM `variablecosts` ORDER BY `variablecosts`.`created_at` ASC
---
    def index
        @variablecosts = Variablecost.order(created_at: :asc)

SELECT `variablecosts`.* FROM `variablecosts` WHERE `variablecosts`.`id` = 1 LIMIT 1
---
    def show
        @variablecost = Variablecost.find(params[:id])

INSERT INTO `variablecosts` (`name`, `description`, `created_at`, `updated_at`) VALUES ('材料代', '売上原価', '2019-12-21 02:09:32.814567', '2019-12-21 02:09:32.814567')
---
    def create
        @variablecost = Variablecost.new(params[:variablecost])
        if @variablecost.save