app/controllers/variablecost_values_controller.rb

SELECT `variablecost_values`.* FROM `variablecost_values` ORDER BY year_month asc
---
	def index
		@variablecosts = Variablecost.order(created_at: :asc)
		@variablecost_values = VariablecostValue.order("yearmonth asc")

SELECT `variablecosts`.* FROM `variablecosts` ORDER BY `variablecosts`.`created_at` ASC
---
	def new
		year_month_day = params[:yearmonth] + "-01"
		@yearmonth = year_month_day.to_date

		@variablecosts = Variablecost.order(created_at: :asc)

SELECT `variablecost_values`.* FROM `variablecost_values` WHERE `variablecost_values`.`id` = 1 LIMIT 1
SELECT `variablecosts`.* FROM `variablecosts` WHERE `variablecosts`.`id` = 1 LIMIT 1
---
	def edit
		@variablecost_value = VariablecostValue.find(params[:id])
		@variablecost = Variablecost.find(@variablecost_value.variablecost_id)

SELECT `variablecost_values`.* FROM `variablecost_values` WHERE `variablecost_values`.`id` = 1 LIMIT 1
UPDATE `variablecost_values` SET `variablecost_values`.`yearmonth` = '2019-12-01', `variablecost_values`.`updated_at` = '2019-12-31 09:03:10.465925' WHERE `variablecost_values`.`id` = 1
---
	def update
		@variablecost_value = VariablecostValue.find(params[:id])
		@variablecost_value.assign_attributes(params[:variablecost_value])
		if @variablecost_value.save