app/views/balance_confirm/show.html.erb

SELECT `incomes`.* FROM `incomes` WHERE `incomes`.`id` = 1 ORDER BY `incomes`.`created_at` ASC LIMIT 1
---
            <tr>
                <td><%= @incomes.find(income_value.income_id).name %></td>

SELECT `fixedcosts`.* FROM `fixedcosts` WHERE `fixedcosts`.`id` = 1 ORDER BY `fixedcosts`.`created_at` ASC LIMIT 1
---
            <tr>
                <td><%= @fixedcosts.find(fixedcost_value.fixedcost_id).name %></td>

SELECT `variablecosts`.* FROM `variablecosts` WHERE `variablecosts`.`id` = 1 ORDER BY `variablecosts`.`created_at` ASC LIMIT 1
---
        <tr>
            <td><%= @variablecosts.find(variablecost_value.variablecost_id).name %></td>