app/views/income_values/index.html.erb

		<td><%= income_value.yearmonth.strftime('%Y年%m月') %></td>
		<td><%= @incomes.find(income_value.income_id).name %></td>
---
SELECT `incomes`.* FROM `incomes` WHERE `incomes`.`id` = 1 ORDER BY `incomes`.`created_at` ASC LIMIT 1