app/views/income_values/new.html.erb

   <th>
    <%= @incomes.find(@form.income_values[cnt].income_id).name %>
---
SELECT `incomes`.* FROM `incomes` WHERE `incomes`.`id` = 1 ORDER BY `incomes`.`created_at` ASC LIMIT 1